app/views/bugs/_form.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  	<%= form.label :user_id %>
  	<%= form.select :user_id,
  		options_for_select(User.all.collect {|u| ["#{u.lname},#{u.fname}", u.id]},
  		selected: (@bug.user ? @bug.user_id : User.first.id)), {} %>