app/controllers/bugs_controller.rb

  def index
	@bugs = Bug.all
---
SELECT "bugs".* FROM "bugs"

  def create
	@bug = Bug.new(bug_params)
	user = User.find(bug_params[:user_id])
	@bug.build_user(:id => user.id)

	respond_to do |format|
	  if @bug.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "bugs" ("title", "description", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "title"], ["description", "description"], ["status", nil], ["created_at", "2018-02-22 02:36:00.243266"], ["updated_at", "2018-02-22 02:36:00.243266"]]

  def update
	respond_to do |format|
	  if @bug.update(bug_params)
---
UPDATE "bugs" SET "description" = ?, "updated_at" = ? WHERE "bugs"."id" = ?  [["description", "this is a description change"], ["updated_at", "2018-02-23 00:36:13.793567"], ["id", 4]]

  def destroy
	@bug.destroy
---
DELETE FROM "bugs" WHERE "bugs"."id" = ?  [["id", 1]]

	def set_bug
	  @bug = Bug.find(params[:id])
---
SELECT  "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]