app/controllers/home_controller.rb

    def index
        @bugs = Bug.last(3)
---
SELECT  "bugs".* FROM "bugs" ORDER BY "bugs"."id" DESC LIMIT ?  [["LIMIT", 3]]